//API4JCOM JOB (ACCT#),'COMP TEST ANOMLOG',MSGCLASS=H,REGION=4M,
//           CLASS=A,MSGLEVEL=(1,1),NOTIFY=&SYSUID
//*
//* Compile & link the ANOMLOG unit-test driver TESTANOML
//*
//         SET  PGMNAME=TSTANOML   
//COMPTST  EXEC IGYWCL
//COBOL.SYSLIB   DD  DSN=API4.PROJET.TST.COPYBOOK,DISP=SHR
//COBOL.SYSIN    DD  DSN=API4.PROJET.TST.COBOL(&PGMNAME),DISP=SHR
//LKED.SYSLMOD   DD  DSN=API4.PROJET.TST.LOAD(&PGMNAME),DISP=SHR
/*
