//API4EXET JOB (ACCT#),'ANOMLOG TEST',MSGCLASS=H,REGION=4M,
//           CLASS=A,MSGLEVEL=(1,1),NOTIFY=&SYSUID
//*
//* ETAPE EXECUTION - ANOMLOG UNIT TESTS
//*
//TESTANM  EXEC PGM=TSTANOML
//STEPLIB  DD DSN=API4.PROJET.TST.LOAD,DISP=SHR
//SYSOUT   DD SYSOUT=*
//DDOUT2   DD DSN=&&TEMPLOG,
//            DISP=(NEW,PASS,DELETE),
//            DCB=(RECFM=FB,LRECL=80,BLKSIZE=0),
//            SPACE=(TRK,(1,1),RLSE),UNIT=SYSDA
