//API4DB2 JOB (ACCT#),'COMPDB2',MSGCLASS=H,REGION=4M,
//        CLASS=A,MSGLEVEL=(1,1),NOTIFY=&SYSUID,
//        COND=(4,LT),TIME=(0,5)
//PROCLIB  JCLLIB ORDER=SDJ.FORM.PROCLIB
//*        MAINDRV = cobol driver/switchesboard for the subprograms
//         SET USERID=API4,NOMPGM=MAINDRV
//*
//APPRODRV EXEC IGYWCL
//COBOL.SYSIN      DD DSN=&USERID..PROJET.COBOL(&NOMPGM),DISP=SHR
//LKED.SYSLMOD     DD DSN=&USERID..PROJET.LOAD(&NOMPGM),DISP=SHR
//*-- Compile called subprogram 1 (change name as needed) ----------*
//*        SUBPROCA = subprogram A of MAINDRV
//         SET NOMPGM=SUBPROCA
//APPROCA  EXEC COMPDB2
//STEPDB2.SYSLIB   DD DSN=&USERID..PROJET.DCLGEN,DISP=SHR
//STEPDB2.SYSIN    DD DSN=&USERID..PROJET.DB2(&NOMPGM),DISP=SHR
//STEPDB2.DBRMLIB  DD DSN=&USERID..PROJET.DBRMLIB(&NOMPGM),DISP=SHR
//STEPLNK.SYSLMOD  DD DSN=&USERID..PROJET.LOAD(&NOMPGM),DISP=SHR
//*-- Compile called subprogram 2 (change name as needed) ----------*
//*        SUBPROCB = subprogram B of MAINDRV
//         SET NOMPGM=SUBPROCB
//APPROCB  EXEC COMPDB2
//STEPDB2.SYSLIB   DD DSN=&USERID..PROJET.DCLGEN,DISP=SHR
//STEPDB2.SYSIN    DD DSN=&USERID..PROJET.DB2(&NOMPGM),DISP=SHR
//STEPDB2.DBRMLIB  DD DSN=&USERID..PROJET.DBRMLIB(&NOMPGM),DISP=SHR
//STEPLNK.SYSLMOD  DD DSN=&USERID..PROJET.LOAD(&NOMPGM),DISP=SHR
//*-- Compile called subprogram 3 (change name as needed) ----------*
//*        SUBPROCC = subprogram C of MAINDRV                 
//         SET NOMPGM=SUBPROCC
//APPROCC  EXEC COMPDB2
//STEPDB2.SYSLIB   DD DSN=&USERID..PROJET.DCLGEN,DISP=SHR
//STEPDB2.SYSIN    DD DSN=&USERID..PROJET.DB2(&NOMPGM),DISP=SHR
//STEPDB2.DBRMLIB  DD DSN=&USERID..PROJET.DBRMLIB(&NOMPGM),DISP=SHR
//STEPLNK.SYSLMOD  DD DSN=&USERID..PROJET.LOAD(&NOMPGM),DISP=SHR
//*--- BIND PLAN INCLUDING ALL DBRM MEMBERS WITH SQL ---------------*
//BIND     EXEC PGM=IKJEFT01,COND=(4,LT)
//DBRMLIB  DD  DSN=&USERID..PROJET.DBRMLIB,DISP=SHR
//SYSTSPRT DD  SYSOUT=*,OUTLIM=25000
//SYSTSIN  DD  *
  DSN SYSTEM (DSN1)
  BIND PLAN      (MAINDRV) -
       QUALIFIER (API4)    -
       ACTION    (REPLACE) -
       MEMBER    (SUBPROCA) -
       VALIDATE  (BIND)    -
       ISOLATION (CS)      -
       ACQUIRE   (USE)     -
       RELEASE   (COMMIT)  -
       EXPLAIN   (NO)
/*
//*--- RUN DRIVER; SELECT SUBPROC VIA PARM -------------------------*
//* write into stats and jrn datasets, if not present it will be created
//STEPRUN  EXEC PGM=IKJEFT01,COND=(4,LT)
//STEPLIB  DD  DSN=&USERID..PROJET.LOAD,DISP=SHR
//SYSOUT   DD  SYSOUT=*,OUTLIM=1000
//SYSTSPRT DD  SYSOUT=*,OUTLIM=2500
//DDOUT1   DD  DSN=&USERID..PROJET.STATS.DATA,
//             DISP=(MOD,CATLG,DELETE),
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=0),
//             SPACE=(TRK,(1,1),RLSE),
//             UNIT=SYSDA
//DDOUT2   DD  DSN=&USERID..PROJET.JRN.DATA,
//             DISP=(MOD,CATLG,DELETE),
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=0),
//             SPACE=(TRK,(1,1),RLSE),
//             UNIT=SYSDA
//SYSTSIN  DD  *
  DSN SYSTEM (DSN1)
  RUN PROGRAM(MAINDRV) PLAN(MAINDRV) PARM('SUBPROCA')
/*